In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
population = pd.Series([12345.6, 23456.7, 34567.8, 45678.9, 5678,1])

In [3]:
population

0    12345.6
1    23456.7
2    34567.8
3    45678.9
4     5678.0
5        1.0
dtype: float64

In [4]:
population.name = "Nigeria's Population"
population

0    12345.6
1    23456.7
2    34567.8
3    45678.9
4     5678.0
5        1.0
Name: Nigeria's Population, dtype: float64

In [5]:
population.values

array([1.23456e+04, 2.34567e+04, 3.45678e+04, 4.56789e+04, 5.67800e+03,
       1.00000e+00])

In [6]:
population.index = ["Lagos", "Abeokuta", "Anambra", "Osun", "kogi", "Delta"]
population

Lagos       12345.6
Abeokuta    23456.7
Anambra     34567.8
Osun        45678.9
kogi         5678.0
Delta           1.0
Name: Nigeria's Population, dtype: float64

In [7]:
#  to find the numeric position of a pandas series , use "iloc" attribute

In [8]:
population['Lagos']

population[['Osun', 'Anambra']]

Osun       45678.9
Anambra    34567.8
Name: Nigeria's Population, dtype: float64

In [9]:
population.iloc[2]

34567.8

In [10]:
population.iloc[[0, 4]]

Lagos    12345.6
kogi      5678.0
Name: Nigeria's Population, dtype: float64

In [11]:
population['Lagos':'kogi']

Lagos       12345.6
Abeokuta    23456.7
Anambra     34567.8
Osun        45678.9
kogi         5678.0
Name: Nigeria's Population, dtype: float64

In [12]:
population>12000

Lagos        True
Abeokuta     True
Anambra      True
Osun         True
kogi        False
Delta       False
Name: Nigeria's Population, dtype: bool

In [13]:
population[population>12000]

Lagos       12345.6
Abeokuta    23456.7
Anambra     34567.8
Osun        45678.9
Name: Nigeria's Population, dtype: float64

In [14]:
population.mean()

20288.0

In [15]:
population[population > population.mean()]

Abeokuta    23456.7
Anambra     34567.8
Osun        45678.9
Name: Nigeria's Population, dtype: float64

In [16]:
population > population.mean()

Lagos       False
Abeokuta     True
Anambra      True
Osun         True
kogi        False
Delta       False
Name: Nigeria's Population, dtype: bool

In [17]:
population[(population > 25000) | (population>population.mean())]

Abeokuta    23456.7
Anambra     34567.8
Osun        45678.9
Name: Nigeria's Population, dtype: float64

In [18]:
population[(population > 20000) & (population<30000)]

Abeokuta    23456.7
Name: Nigeria's Population, dtype: float64

In [19]:
population['Lagos']=30000
population

Lagos       30000.0
Abeokuta    23456.7
Anambra     34567.8
Osun        45678.9
kogi         5678.0
Delta           1.0
Name: Nigeria's Population, dtype: float64

In [20]:
population.iloc[-3]=40000
population

Lagos       30000.0
Abeokuta    23456.7
Anambra     34567.8
Osun        40000.0
kogi         5678.0
Delta           1.0
Name: Nigeria's Population, dtype: float64

In [21]:
df = pd.DataFrame({
    'Population': [12.34, 23.45, 34.56, 45.67, 56.78, 678.90, 789.98],
    'GDP': [1234567, 2345678, 3456789, 4567890, 5678901, 6789012, 7890123],
    'Surface Area': [123455, 478389, 463789, 897621, 387414, 142409, 749652],
    'MDI': [0.987, 0.876, 0.765, 0.654, 0.543, 0.432, 0.321],
    'Continent': ['Africa', 'Asia', 'Antartica', 'Australia', 'North America', 'South America', 'Europe'],
    }, columns=['Population', 'GDP', 'Surface Area', 'MDI', 'Continent'])

df

   Population      GDP  Surface Area    MDI      Continent
0       12.34  1234567        123455  0.987         Africa
1       23.45  2345678        478389  0.876           Asia
2       34.56  3456789        463789  0.765      Antartica
3       45.67  4567890        897621  0.654      Australia
4       56.78  5678901        387414  0.543  North America
5      678.90  6789012        142409  0.432  South America
6      789.98  7890123        749652  0.321         Europe

In [22]:
df.index = ['Nigeria', 'Cyprus', 'France', 'Fiji', 'Canada', 'Chile', 'Italy' ]
df

         Population      GDP  Surface Area    MDI      Continent
Nigeria       12.34  1234567        123455  0.987         Africa
Cyprus        23.45  2345678        478389  0.876           Asia
France        34.56  3456789        463789  0.765      Antartica
Fiji          45.67  4567890        897621  0.654      Australia
Canada        56.78  5678901        387414  0.543  North America
Chile        678.90  6789012        142409  0.432  South America
Italy        789.98  7890123        749652  0.321         Europe

In [23]:
df.columns

Index(['Population', 'GDP', 'Surface Area', 'MDI', 'Continent'], dtype='object')

In [24]:
df.index

Index(['Nigeria', 'Cyprus', 'France', 'Fiji', 'Canada', 'Chile', 'Italy'], dtype='object')

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, Nigeria to Italy
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Population    7 non-null      float64
 1   GDP           7 non-null      int64
 2   Surface Area  7 non-null      int64
 3   MDI           7 non-null      float64
 4   Continent     7 non-null      object
dtypes: float64(2), int64(2), object(1)
memory usage: 336.0+ bytes

In [26]:
df.size

35

In [27]:
df.shape

(7, 5)

In [28]:
df.describe()

       Population           GDP   Surface Area       MDI
count    7.000000  7.000000e+00       7.000000  7.000000
mean   234.525714  4.566137e+06  463247.000000  0.654000
std    343.308347  2.397525e+06  287252.629586  0.239787
min     12.340000  1.234567e+06  123455.000000  0.321000
25%     29.005000  2.901234e+06  264911.500000  0.487500
50%     45.670000  4.567890e+06  463789.000000  0.654000
75%    367.840000  6.233956e+06  614020.500000  0.820500
max    789.980000  7.890123e+06  897621.000000  0.987000

In [29]:
df.dtypes

Population      float64
GDP               int64
Surface Area      int64
MDI             float64
Continent        object
dtype: object

In [30]:
df.dtypes.value_counts()

float64    2
int64      2
object     1
dtype: int64

'loc' allows selection of rows by index
'iloc' allows selection of rows by index position
(the above works with rows)


but if you want to just show column by column with reference to the index, then you just do:
df['column name']

In [31]:
df

         Population      GDP  Surface Area    MDI      Continent
Nigeria       12.34  1234567        123455  0.987         Africa
Cyprus        23.45  2345678        478389  0.876           Asia
France        34.56  3456789        463789  0.765      Antartica
Fiji          45.67  4567890        897621  0.654      Australia
Canada        56.78  5678901        387414  0.543  North America
Chile        678.90  6789012        142409  0.432  South America
Italy        789.98  7890123        749652  0.321         Europe

In [32]:
df.loc['France']

Population          34.56
GDP               3456789
Surface Area       463789
MDI                 0.765
Continent       Antartica
Name: France, dtype: object

In [33]:
df.iloc[-4]

Population          45.67
GDP               4567890
Surface Area       897621
MDI                 0.654
Continent       Australia
Name: Fiji, dtype: object

In [34]:
df['MDI']

Nigeria    0.987
Cyprus     0.876
France     0.765
Fiji       0.654
Canada     0.543
Chile      0.432
Italy      0.321
Name: MDI, dtype: float64

In [35]:
df.loc['France' : 'Chile']

        Population      GDP  Surface Area    MDI      Continent
France       34.56  3456789        463789  0.765      Antartica
Fiji         45.67  4567890        897621  0.654      Australia
Canada       56.78  5678901        387414  0.543  North America
Chile       678.90  6789012        142409  0.432  South America

In [36]:
df.loc['France' : 'Chile', 'Population':'Surface Area']

        Population      GDP  Surface Area
France       34.56  3456789        463789
Fiji         45.67  4567890        897621
Canada       56.78  5678901        387414
Chile       678.90  6789012        142409

In [37]:
df.loc['France' : 'Chile', ['Population', 'MDI']]

        Population    MDI
France       34.56  0.765
Fiji         45.67  0.654
Canada       56.78  0.543
Chile       678.90  0.432

In [38]:
df.iloc[2 : 6]

        Population      GDP  Surface Area    MDI      Continent
France       34.56  3456789        463789  0.765      Antartica
Fiji         45.67  4567890        897621  0.654      Australia
Canada       56.78  5678901        387414  0.543  North America
Chile       678.90  6789012        142409  0.432  South America

In [39]:
df.iloc[2 : 6, 0 : 3]

        Population      GDP  Surface Area
France       34.56  3456789        463789
Fiji         45.67  4567890        897621
Canada       56.78  5678901        387414
Chile       678.90  6789012        142409

In [40]:
df.iloc[2 : 6, [0 , 3]]

        Population    MDI
France       34.56  0.765
Fiji         45.67  0.654
Canada       56.78  0.543
Chile       678.90  0.432

In [41]:
df.iloc[[0, 1, -1]]

         Population      GDP  Surface Area    MDI Continent
Nigeria       12.34  1234567        123455  0.987    Africa
Cyprus        23.45  2345678        478389  0.876      Asia
Italy        789.98  7890123        749652  0.321    Europe

In [42]:
df

         Population      GDP  Surface Area    MDI      Continent
Nigeria       12.34  1234567        123455  0.987         Africa
Cyprus        23.45  2345678        478389  0.876           Asia
France        34.56  3456789        463789  0.765      Antartica
Fiji          45.67  4567890        897621  0.654      Australia
Canada        56.78  5678901        387414  0.543  North America
Chile        678.90  6789012        142409  0.432  South America
Italy        789.98  7890123        749652  0.321         Europe

In [43]:
df['Population']>40

Nigeria    False
Cyprus     False
France     False
Fiji        True
Canada      True
Chile       True
Italy       True
Name: Population, dtype: bool

In [44]:
df.loc[df['Population']>40]

        Population      GDP  Surface Area    MDI      Continent
Fiji         45.67  4567890        897621  0.654      Australia
Canada       56.78  5678901        387414  0.543  North America
Chile       678.90  6789012        142409  0.432  South America
Italy       789.98  7890123        749652  0.321         Europe

In [45]:
df.loc[df['Population']>40, 'Population']

Fiji       45.67
Canada     56.78
Chile     678.90
Italy     789.98
Name: Population, dtype: float64

In [46]:
df.loc[df['Population']>40, ['Population', 'GDP']]

        Population      GDP
Fiji         45.67  4567890
Canada       56.78  5678901
Chile       678.90  6789012
Italy       789.98  7890123

In [47]:
df.drop(['Cyprus', 'Italy'])

         Population      GDP  Surface Area    MDI      Continent
Nigeria       12.34  1234567        123455  0.987         Africa
France        34.56  3456789        463789  0.765      Antartica
Fiji          45.67  4567890        897621  0.654      Australia
Canada        56.78  5678901        387414  0.543  North America
Chile        678.90  6789012        142409  0.432  South America

In [48]:
df.drop(columns=['GDP', 'MDI'])

         Population  Surface Area      Continent
Nigeria       12.34        123455         Africa
Cyprus        23.45        478389           Asia
France        34.56        463789      Antartica
Fiji          45.67        897621      Australia
Canada        56.78        387414  North America
Chile        678.90        142409  South America
Italy        789.98        749652         Europe

In [49]:
df.drop(['France', 'Chile'], axis='rows')

         Population      GDP  Surface Area    MDI      Continent
Nigeria       12.34  1234567        123455  0.987         Africa
Cyprus        23.45  2345678        478389  0.876           Asia
Fiji          45.67  4567890        897621  0.654      Australia
Canada        56.78  5678901        387414  0.543  North America
Italy        789.98  7890123        749652  0.321         Europe

In [50]:
df[['Population', 'GDP']]/100

         Population       GDP
Nigeria      0.1234  12345.67
Cyprus       0.2345  23456.78
France       0.3456  34567.89
Fiji         0.4567  45678.90
Canada       0.5678  56789.01
Chile        6.7890  67890.12
Italy        7.8998  78901.23

In [51]:
df

         Population      GDP  Surface Area    MDI      Continent
Nigeria       12.34  1234567        123455  0.987         Africa
Cyprus        23.45  2345678        478389  0.876           Asia
France        34.56  3456789        463789  0.765      Antartica
Fiji          45.67  4567890        897621  0.654      Australia
Canada        56.78  5678901        387414  0.543  North America
Chile        678.90  6789012        142409  0.432  South America
Italy        789.98  7890123        749652  0.321         Europe

In [52]:
crisis = pd.Series([-1000000, -0.3], index=['GDP', 'MDI'])
crisis

GDP   -1000000.0
MDI         -0.3
dtype: float64

In [53]:
df[['GDP', 'MDI']]

             GDP    MDI
Nigeria  1234567  0.987
Cyprus   2345678  0.876
France   3456789  0.765
Fiji     4567890  0.654
Canada   5678901  0.543
Chile    6789012  0.432
Italy    7890123  0.321

In [54]:
df[['GDP', 'MDI']] + crisis

               GDP    MDI
Nigeria   234567.0  0.687
Cyprus   1345678.0  0.576
France   2456789.0  0.465
Fiji     3567890.0  0.354
Canada   4678901.0  0.243
Chile    5789012.0  0.132
Italy    6890123.0  0.021

In [55]:
df[['GDP', 'MDI']] + [-1000000, -0.3]

               GDP    MDI
Nigeria   234567.0  0.687
Cyprus   1345678.0  0.576
France   2456789.0  0.465
Fiji     3567890.0  0.354
Canada   4678901.0  0.243
Chile    5789012.0  0.132
Italy    6890123.0  0.021

to add new columns in a pd using pd series

In [56]:
langs = pd.Series(
    ['Pidgin', 'French', 'English', 'Italian', 'Spanish', 'Greek'],
    index=['Nigeria', 'France', 'Canada', 'Italy', 'Chile', 'Cyprus'],
    name='Language'
)
langs

Nigeria     Pidgin
France      French
Canada     English
Italy      Italian
Chile      Spanish
Cyprus       Greek
Name: Language, dtype: object

In [57]:
df['Language'] = langs
df

         Population      GDP  Surface Area    MDI      Continent Language
Nigeria       12.34  1234567        123455  0.987         Africa   Pidgin
Cyprus        23.45  2345678        478389  0.876           Asia    Greek
France        34.56  3456789        463789  0.765      Antartica   French
Fiji          45.67  4567890        897621  0.654      Australia      NaN
Canada        56.78  5678901        387414  0.543  North America  English
Chile        678.90  6789012        142409  0.432  South America  Spanish
Italy        789.98  7890123        749652  0.321         Europe  Italian

In [58]:
df['Language'].replace('Pidgin', 'English')

Nigeria    English
Cyprus       Greek
France      French
Fiji           NaN
Canada     English
Chile      Spanish
Italy      Italian
Name: Language, dtype: object

In [59]:
df.append(pd.Series({
    'Population':3,
    'GDP':5
}, name='China'))

C:\Users\NELSON ESTHER\AppData\Local\Temp\ipykernel_26836\1748578080.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(pd.Series({

         Population      GDP  Surface Area    MDI      Continent Language
Nigeria       12.34  1234567      123455.0  0.987         Africa   Pidgin
Cyprus        23.45  2345678      478389.0  0.876           Asia    Greek
France        34.56  3456789      463789.0  0.765      Antartica   French
Fiji          45.67  4567890      897621.0  0.654      Australia      NaN
Canada        56.78  5678901      387414.0  0.543  North America  English
Chile        678.90  6789012      142409.0  0.432  South America  Spanish
Italy        789.98  7890123      749652.0  0.321         Europe  Italian
China          3.00        5           NaN    NaN            NaN      NaN

In [60]:
df['GDP Per Caita'] = df['GDP'] / df['Population']
df

,Population,GDP,Surface Area,MDI,Continent,Language,GDP Per Caita
Nigeria,12.34,1234567,123455,0.987,Africa,Pidgin,100045.948136
Cyprus,23.45,2345678,478389,0.876,Asia,Greek,100028.912580
France,34.56,3456789,463789,0.765,Antartica,French,100022.829861
Fiji,45.67,4567890,897621,0.654,Australia,NaN,100019.487629
Canada,56.78,5678901,387414,0.543,North America,English,100015.868263
Chile,678.90,6789012,142409,0.432,South America,Spanish,10000.017676
Italy,789.98,7890123,749652,0.321,Europe,Italian,9987.750323

In [61]:
df = pd.read_csv("C:/Users/NELSON ESTHER/Desktop/btc-market-price.csv")

In [62]:
df.head()

   2017-04-02 00:00:00  1099.169125
0  2017-04-03 00:00:00  1141.813000
1  2017-04-04 00:00:00  1141.600363
2  2017-04-05 00:00:00  1133.079314
3  2017-04-06 00:00:00  1196.307937
4  2017-04-07 00:00:00  1190.454250

to be abe to read a csv that has no column name, use header=None

In [63]:
df = pd.read_csv("C:/Users/NELSON ESTHER/Desktop/btc-market-price.csv", header=None)
df.head()

                     0            1
0  2017-04-02 00:00:00  1099.169125
1  2017-04-03 00:00:00  1141.813000
2  2017-04-04 00:00:00  1141.600363
3  2017-04-05 00:00:00  1133.079314
4  2017-04-06 00:00:00  1196.307937

In [67]:
df.columns = ['Timestamp', 'Price']
df.shape

(365, 2)

In [68]:
df.tail(5)

               Timestamp        Price
360  2018-03-28 00:00:00  7960.380000
361  2018-03-29 00:00:00  7172.280000
362  2018-03-30 00:00:00  6882.531667
363  2018-03-31 00:00:00  6935.480000
364  2018-04-01 00:00:00  6794.105000

In [69]:
df.dtypes

Timestamp     object
Price        float64
dtype: object

In [73]:
df['Timestamp'] = pd.to_datetime(df['Timestamp'])
df.head()

   Timestamp        Price
0 2017-04-02  1099.169125
1 2017-04-03  1141.813000
2 2017-04-04  1141.600363
3 2017-04-05  1133.079314
4 2017-04-06  1196.307937

In [74]:
df.dtypes

Timestamp    datetime64[ns]
Price               float64
dtype: object